app/controllers/api/v1/recipes_controller.rb

            end

            # Apply the conditions to the Recipe model
            @recipes = Recipe.where(conditions.join(' AND '), *search_terms_for_query)
---
SELECT "recipes".* FROM "recipes" WHERE (EXISTS (SELECT 1 FROM unnest(recipes.ingredients) AS ri WHERE ri ILIKE $1) AND EXISTS (SELECT 1 FROM unnest(recipes.ingredients) AS ri WHERE ri ILIKE $2))  [[nil, "%chicken%"], [nil, "%rice%"]]