app/controllers/recipes_controller.rb

  def search
    keywords_param = params[:keywords]
    match_all = params[:match_all].present? # Check if match_all parameter is present

    if keywords_param.present?
      # Split the keywords by comma and remove empty strings
      keywords = keywords_param.split(',').map(&:strip).reject(&:empty?)

      if match_all
        @recipes = Recipe.find_by_all_ingredients(keywords)
      else
        @recipes = Recipe.find_by_any_ingredient(keywords)
      end
    else
      @recipes = Recipe.all # If no keywords, show all recipes
---
SELECT "recipes".* FROM "recipes" WHERE (EXISTS (SELECT 1 FROM unnest(ingredients) AS ingredient WHERE TRIM(LOWER(ingredient::text)) ILIKE '%flour%') AND EXISTS (SELECT 1 FROM unnest(ingredients) AS ingredient WHERE TRIM(LOWER(ingredient::text)) ILIKE '%sugar%'))